[
  {
    "id": "techcrunch.com_2025_07_26_astronomer-winks-at-viral-notoriety-with-temporary-spokesperson-gwyneth-paltrow_",
    "url": "https://techcrunch.com/2025/07/26/astronomer-winks-at-viral-notoriety-with-temporary-spokesperson-gwyneth-paltrow/",
    "title": "Astronomer winks at viral notoriety with ‘temporary spokesperson’ Gwyneth Paltrow | TechCrunch",
    "content": "Astronomer winks at viral notoriety with ‘temporary spokesperson’ Gwyneth Paltrow | TechCrunch Astronomer winks at viral notoriety with ‘temporary spokesperson’ Gwyneth Paltrow | TechCrunch TechCrunch Desktop Logo TechCrunch Mobile Logo LatestStartupsVentureAppleSecurityAIApps EventsPodcastsNewsletters SearchSubmit Site Search Toggle Mega Menu Toggle Topics Latest AI Amazon Apps Biotech & Health Climate Cloud Computing Commerce Crypto Enterprise EVs Fintech Fundraising Gadgets Gaming Google Government & Policy Hardware Instagram Layoffs Media & Entertainment Meta Microsoft Privacy Robotics Security Social Space Startups TikTok Transportation Venture More from TechCrunch Staff Events Startup Battlefield StrictlyVC Newsletters Podcasts Videos Partner Content TechCrunch Brand Studio Crunchboard Contact Us Image Credits:Astronomer Media & Entertainment Astronomer winks at viral notoriety with ‘temporary spokesperson’ Gwyneth Paltrow Anthony Ha 12:40 PM PDT · July 26, 2025 After spending the past week-plus in the headlines due to a seemingly inescapable social media scandal, data operations startup Astronomer is trying to shift the narrative with a tongue-in-cheek video starring actress and entrepreneur Gwyneth Paltrow. Paltrow was, of course, previously married to Coldplay singer Chris Martin. And it was at a Coldplay concert in Massachusetts that the company’s CEO Andy Byron and chief people officer Kristin Cabot were apparently caught dancing together on the “kiss cam.” When Byron and Cabot (who are reportedly married to other people) awkwardly tried to hide from the camera, Martin joked, “Either they’re having an affair or they’re just very shy.” Footage of the exchange exploded in popularity, ultimately leading both executives to resign from Astronomer. In announcing Byron’s resignation, the company said, “Our leaders are expected to set the standard in both conduct and accountability, and recently, that standard was not met.” Astronomer’s statement also nodded at the fact that the company had suddenly become famous for reasons having nothing to do with its product: “While awareness of our company may have changed overnight, our product and our work for our customers have not.” Its new marketing video has a similar message, attempting to refocus the conversation on Astronomer’s technology, while winkingly acknowledging why that might be a challenge. Paltrow kicks things off by introducing herself as someone who’s been “hired on a very temporary basis to speak on behalf of the 300-plus employees at Astronomer.” She then promises to answer the “most common” questions asked about the company — but when the briefly glimpsed, half-typed questions are all about you-know-what, Paltrow remains cheerfully, and resolutely, on-message. Techcrunch event Tech and VC heavyweights join the Disrupt 2025 agenda Netflix, ElevenLabs, Wayve, Sequoia Capital, Elad Gil — just a few of the heavy hitters joining the Disrupt 2025 agenda. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $600+ before prices rise. Tech and VC heavyweights join the Disrupt 2025 agenda Netflix, ElevenLabs, Wayve, Sequoia Capital — just a few of the heavy hitters joining the Disrupt 2025 agenda. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise. San Francisco | October 27-29, 2025 REGISTER NOW “We’ve been thrilled so many people have a newfound interest in data workflow automation,” she says. Paltrow even finds time to plug the company’s upcoming conference before concluding, “We will now be returning to what we do best — delivering game-changing results for our customers.” Topics Astronomer, Enterprise, gwyneth paltrow, Media & Entertainment Anthony Ha Anthony Ha is TechCrunch’s weekend editor. Previously, he worked as a tech reporter at Adweek, a senior editor at VentureBeat, a local government reporter at the Hollister Free Lance, and vice president of content at a VC firm. He lives in New York City. View Bio October 27-29, 2025 San Francisco Put your brand in front of 10,000+ tech and VC leaders across all three days of Disrupt 2025. Amplify your reach, spark real connections, and lead the innovation charge. Secure your exhibit space before your competitor does. Book Your Table Most Popular OpenAI lawyers question Meta’s role in Elon Musk’s $97B takeover bid Maxwell Zeff YouTube Music celebrates 10 years with new features that help it compete with Spotify Sarah Perez Harvard dropouts to launch ‘always on’ AI smart glasses that listen and record every conversation Lorenzo Franceschi-Bicchierai Rebecca Bellan Google launches a new Pixel Journal app Ivan Mehta Why Paradigm built ",
    "metadata": {
      "summary": "Data operations startup Astronomer, embroiled in a social media scandal leading to the resignation of its CEO and CPO, has launched a new marketing video featuring Gwyneth Paltrow. The video is a tongue-in-cheek attempt to shift the narrative and refocus public attention on the company's technology rather than the viral incident.",
      "keywords": [
        "Astronomer",
        "Gwyneth Paltrow",
        "social media scandal",
        "data operations startup",
        "marketing video",
        "CEO resignation",
        "corporate image"
      ],
      "sentiment": -0.1,
      "category": "technology"
    },
    "entities": [],
    "processed_at": "2025-08-24 13:01:55.133843"
  }
]