[
  {
    "id": "techcrunch.com_2025_07_26_astronomer-winks-at-viral-notoriety-with-temporary-spokesperson-gwyneth-paltrow_",
    "url": "https://techcrunch.com/2025/07/26/astronomer-winks-at-viral-notoriety-with-temporary-spokesperson-gwyneth-paltrow/",
    "title": "Astronomer winks at viral notoriety with ‘temporary spokesperson’ Gwyneth Paltrow | TechCrunch",
    "content": "Astronomer winks at viral notoriety with ‘temporary spokesperson’ Gwyneth Paltrow | TechCrunch Astronomer winks at viral notoriety with ‘temporary spokesperson’ Gwyneth Paltrow | TechCrunch TechCrunch Desktop Logo TechCrunch Mobile Logo LatestStartupsVentureAppleSecurityAIApps EventsPodcastsNewsletters SearchSubmit Site Search Toggle Mega Menu Toggle Topics Latest AI Amazon Apps Biotech & Health Climate Cloud Computing Commerce Crypto Enterprise EVs Fintech Fundraising Gadgets Gaming Google Government & Policy Hardware Instagram Layoffs Media & Entertainment Meta Microsoft Privacy Robotics Security Social Space Startups TikTok Transportation Venture More from TechCrunch Staff Events Startup Battlefield StrictlyVC Newsletters Podcasts Videos Partner Content TechCrunch Brand Studio Crunchboard Contact Us Image Credits:Astronomer Media & Entertainment Astronomer winks at viral notoriety with ‘temporary spokesperson’ Gwyneth Paltrow Anthony Ha 12:40 PM PDT · July 26, 2025 After spending the past week-plus in the headlines due to a seemingly inescapable social media scandal, data operations startup Astronomer is trying to shift the narrative with a tongue-in-cheek video starring actress and entrepreneur Gwyneth Paltrow. Paltrow was, of course, previously married to Coldplay singer Chris Martin. And it was at a Coldplay concert in Massachusetts that the company’s CEO Andy Byron and chief people officer Kristin Cabot were apparently caught dancing together on the “kiss cam.” When Byron and Cabot (who are reportedly married to other people) awkwardly tried to hide from the camera, Martin joked, “Either they’re having an affair or they’re just very shy.” Footage of the exchange exploded in popularity, ultimately leading both executives to resign from Astronomer. In announcing Byron’s resignation, the company said, “Our leaders are expected to set the standard in both conduct and accountability, and recently, that standard was not met.” Astronomer’s statement also nodded at the fact that the company had suddenly become famous for reasons having nothing to do with its product: “While awareness of our company may have changed overnight, our product and our work for our customers have not.” Its new marketing video has a similar message, attempting to refocus the conversation on Astronomer’s technology, while winkingly acknowledging why that might be a challenge. Paltrow kicks things off by introducing herself as someone who’s been “hired on a very temporary basis to speak on behalf of the 300-plus employees at Astronomer.” She then promises to answer the “most common” questions asked about the company — but when the briefly glimpsed, half-typed questions are all about you-know-what, Paltrow remains cheerfully, and resolutely, on-message. Techcrunch event Tech and VC heavyweights join the Disrupt 2025 agenda Netflix, ElevenLabs, Wayve, Sequoia Capital, Elad Gil — just a few of the heavy hitters joining the Disrupt 2025 agenda. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $600+ before prices rise. Tech and VC heavyweights join the Disrupt 2025 agenda Netflix, ElevenLabs, Wayve, Sequoia Capital — just a few of the heavy hitters joining the Disrupt 2025 agenda. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise. San Francisco | October 27-29, 2025 REGISTER NOW “We’ve been thrilled so many people have a newfound interest in data workflow automation,” she says. Paltrow even finds time to plug the company’s upcoming conference before concluding, “We will now be returning to what we do best — delivering game-changing results for our customers.” Topics Astronomer, Enterprise, gwyneth paltrow, Media & Entertainment Anthony Ha Anthony Ha is TechCrunch’s weekend editor. Previously, he worked as a tech reporter at Adweek, a senior editor at VentureBeat, a local government reporter at the Hollister Free Lance, and vice president of content at a VC firm. He lives in New York City. View Bio October 27-29, 2025 San Francisco Put your brand in front of 10,000+ tech and VC leaders across all three days of Disrupt 2025. Amplify your reach, spark real connections, and lead the innovation charge. Secure your exhibit space before your competitor does. Book Your Table Most Popular Coinbase CEO explains why he fired engineers who didn’t try AI immediately Julie Bort OpenAI lawyers question Meta’s role in Elon Musk’s $97B takeover bid Maxwell Zeff YouTube Music celebrates 10 years with new features that help it compete with Spotify Sarah Perez Harvard dropouts to launch ‘always on’ AI smart glasses that listen and record every conversation Lorenzo Franceschi-Bicchierai",
    "metadata": {
      "summary": "Data operations startup Astronomer hired Gwyneth Paltrow as a temporary spokesperson to produce a marketing video. This effort aims to redirect attention from a recent social media scandal, where its CEO Andy Byron and CPO Kristin Cabot resigned after being caught on a \"kiss cam\" at a Coldplay concert. Paltrow humorously acknowledges the viral incident while attempting to re-focus the narrative on Astronomer's technology and services.",
      "keywords": [
        "Astronomer",
        "Gwyneth Paltrow",
        "social media scandal",
        "marketing strategy",
        "data operations",
        "CEO resignation",
        "public relations"
      ],
      "entities": [
        "Astronomer",
        "Gwyneth Paltrow",
        "Andy Byron",
        "Kristin Cabot",
        "Chris Martin",
        "TechCrunch",
        "Coldplay",
        "Netflix",
        "ElevenLabs",
        "Wayve",
        "Sequoia Capital",
        "TechCrunch Disrupt 2025",
        "San Francisco"
      ],
      "sentiment": 0.2,
      "category": "technology"
    },
    "entities": [],
    "processed_at": "2025-08-25 01:02:03.485557"
  },
  {
    "id": "techcrunch.com_2025_07_26_allianz-life-says-majority-of-customers-personal-data-stolen-in-cyberattack_",
    "url": "https://techcrunch.com/2025/07/26/allianz-life-says-majority-of-customers-personal-data-stolen-in-cyberattack/",
    "title": "Allianz Life says 'majority' of customers' personal data stolen in cyberattack | TechCrunch",
    "content": "Allianz Life says 'majority' of customers' personal data stolen in cyberattack | TechCrunch Allianz Life says 'majority' of customers' personal data stolen in cyberattack | TechCrunch TechCrunch Desktop Logo TechCrunch Mobile Logo LatestStartupsVentureAppleSecurityAIApps EventsPodcastsNewsletters SearchSubmit Site Search Toggle Mega Menu Toggle Topics Latest AI Amazon Apps Biotech & Health Climate Cloud Computing Commerce Crypto Enterprise EVs Fintech Fundraising Gadgets Gaming Google Government & Policy Hardware Instagram Layoffs Media & Entertainment Meta Microsoft Privacy Robotics Security Social Space Startups TikTok Transportation Venture More from TechCrunch Staff Events Startup Battlefield StrictlyVC Newsletters Podcasts Videos Partner Content TechCrunch Brand Studio Crunchboard Contact Us Image Credits:Richard Levine/Corbis / Getty Images (Image has been modified) Security Allianz Life says ‘majority’ of customers’ personal data stolen in cyberattack Zack Whittaker 6:40 AM PDT · July 26, 2025 U.S. insurance giant Allianz Life has confirmed to TechCrunch that hackers stole the personal information of the “majority” of its customers, financial professionals, and employees during a mid-July data breach. When reached by TechCrunch, Allianz Life spokesperson Brett Weinberg confirmed the breach. “On July 16, 2025, a malicious threat actor gained access to a third-party, cloud-based CRM system used by Allianz Life,” referring to a customer relationship management (CRM) database containing information on its customers. “The threat actor was able to obtain personally identifiable data related to the majority of Allianz Life’s customers, financial professionals, and select Allianz Life employees, using a social engineering technique,” the spokesperson said. The company disclosed the data breach on Saturday in a legally required filing with Maine’s attorney general but did not immediately provide a number of how many Allianz Life customers are affected. According to the spokesperson, Allianz Life has 1.4 million customers. Its parent company, Allianz, has more than 125 million customers worldwide. Allianz Life said it notified the FBI and added it had “no evidence” that any other systems on its network were compromised. The insurance giant would not say if it had received any communication from the hackers, such as a ransom note. The company also would not attribute the breach to a hacking group. Allianz Life is the latest company in the past month to have been hacked during a wave of data breaches targeting the wider insurance industry, including Aflac, a major provider of supplementary health insurance. Security researchers at Google said in June that they were “aware of multiple intrusions” across the insurance sector attributed to Scattered Spider, a collective of hackers and techniques that rely on social engineering methods, such as deceptively calling and tricking help desks into granting them access to a company’s network. Prior to targeting insurance companies, the Scattered Spider hackers were seen targeting the U.K. retail industry, as well as the aviation and transportation sectors, and are historically known for hacks targeting Silicon Valley technology giants. Per the Maine filing, Allianz plans to begin notifying affected individuals around August 1. Do you know more about the Allianz Life cyberattack? Are you an affected customer or employee? Securely contact this reporter via encrypted message at zackwhittaker.1337 on Signal. Topics cyberattack, cybersecurity, data breach, Exclusive, insurance, Scattered Spider, Security Zack Whittaker Security Editor Zack Whittaker is the security editor at TechCrunch. He can be reached via encrypted message at zackwhittaker.1337 on Signal. You can also contact him by email, or to verify outreach, at zack.whittaker@techcrunch.com. View Bio October 27-29, 2025 San Francisco Put your brand in front of 10,000+ tech and VC leaders across all three days of Disrupt 2025. Amplify your reach, spark real connections, and lead the innovation charge. Secure your exhibit space before your competitor does. Book Your Table Most Popular Coinbase CEO explains why he fired engineers who didn’t try AI immediately Julie Bort OpenAI lawyers question Meta’s role in Elon Musk’s $97B takeover bid Maxwell Zeff YouTube Music celebrates 10 years with new features that help it compete with Spotify Sarah Perez Harvard dropouts to launch ‘always on’ AI smart glasses that listen and record every conversation Lorenzo Franceschi-Bicchierai Rebecca Bellan Google launches a new Pixel Journal app Ivan Mehta Why Paradigm built a spreadsheet with an AI agent in every cell Rebecca Szkutak HR giant Workday says hackers stole personal data in recent breach Zack Whittaker Loading the next article Error loading the next article X LinkedIn Facebook Instagram youTube Mastodon Threads Bluesky TechCrunchStaffContact UsAdvertiseCrunchboard JobsSite Map Terms of ServicePrivacy PolicyRSS Terms of UseCode of",
    "metadata": {
      "summary": "Allianz Life, a U.S. insurance giant, confirmed that a cyberattack in mid-July 2025 led to the theft of personal data from the majority of its 1.4 million customers, financial professionals, and employees. The breach occurred via a third-party cloud-based CRM system using a social engineering technique. This incident is part of a broader wave of data breaches affecting the insurance industry, with Google researchers attributing similar attacks to the Scattered Spider hacking group.",
      "keywords": [
        "cyberattack",
        "data breach",
        "Allianz Life",
        "insurance industry",
        "personal data theft",
        "social engineering",
        "Scattered Spider"
      ],
      "entities": [
        "Allianz Life",
        "TechCrunch",
        "Allianz",
        "FBI",
        "Google",
        "Scattered Spider",
        "Aflac",
        "Zack Whittaker",
        "CRM system",
        "United States"
      ],
      "sentiment": -0.7,
      "category": "technology"
    },
    "entities": [],
    "processed_at": "2025-08-25 01:02:10.312713"
  },
  {
    "id": "techcrunch.com_2025_07_27_itch-io-is-the-latest-marketplace-to-crack-down-on-adult-games_",
    "url": "https://techcrunch.com/2025/07/27/itch-io-is-the-latest-marketplace-to-crack-down-on-adult-games/",
    "title": "Itch.io is the latest marketplace to crack down on adult games | TechCrunch",
    "content": "Itch.io is the latest marketplace to crack down on adult games | TechCrunch Itch.io is the latest marketplace to crack down on adult games | TechCrunch TechCrunch Desktop Logo TechCrunch Mobile Logo LatestStartupsVentureAppleSecurityAIApps EventsPodcastsNewsletters SearchSubmit Site Search Toggle Mega Menu Toggle Topics Latest AI Amazon Apps Biotech & Health Climate Cloud Computing Commerce Crypto Enterprise EVs Fintech Fundraising Gadgets Gaming Google Government & Policy Hardware Instagram Layoffs Media & Entertainment Meta Microsoft Privacy Robotics Security Social Space Startups TikTok Transportation Venture More from TechCrunch Staff Events Startup Battlefield StrictlyVC Newsletters Podcasts Videos Partner Content TechCrunch Brand Studio Crunchboard Contact Us Image Credits:Hase-Hoch-2 / Getty Images Gaming Itch.io is the latest marketplace to crack down on adult games Anthony Ha 11:12 AM PDT · July 27, 2025 Indie video game marketplace Itch.io announced this week that it has “deindexed” adult and not-safe-for-work games, removing them from its browse and search pages. The move, the company said, was in response to a campaign by Collective Shout (an advocacy group that has previously criticized video games, rap music, and lingerie commercials) targeting both Itch.io and Steam for selling “No Mercy,” a game that depicts rape and incest. In an open letter addressed to executives at PayPal, Mastercard, Visa, and other payment processors, Collective Shout said that games “endorsing men’s sexualised abuse and torture of women and girls fly in the face of efforts to address violence against women.” “We do not see how facilitating payment transactions and deriving financial benefit from these violent and unethical games, is consistent with your corporate values and mission statements,” the organization added. The campaign appears to have worked, with Steam saying earlier this month that it would ban games that “may violate the rules and standards set forth by Steam’s payment processors and related card networks and banks, or internet network providers.” Similarly, Itch.io said, “To ensure that we can continue to operate and provide a marketplace for all developers, we must prioritize our relationship with our payment partners and take immediate steps towards compliance.” It also said that “No Mercy” had been “temporarily available on itch.io before being banned back in April,” and that “the situation developed rapidly,” forcing the company to “act urgently to protect the platform’s core payment infrastructure,” without providing advanced notice to creators. Techcrunch event Tech and VC heavyweights join the Disrupt 2025 agenda Netflix, ElevenLabs, Wayve, Sequoia Capital, Elad Gil — just a few of the heavy hitters joining the Disrupt 2025 agenda. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $600+ before prices rise. Tech and VC heavyweights join the Disrupt 2025 agenda Netflix, ElevenLabs, Wayve, Sequoia Capital — just a few of the heavy hitters joining the Disrupt 2025 agenda. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise. San Francisco | October 27-29, 2025 REGISTER NOW The company said it’s now conducting a “comprehensive audit” to ensure that games available on the marketplace meet “the requirements of our payment processors,” with adult content remaining deindexed until the audit is complete. After the audit, Itch.io said NSFW game creators will be required to confirm that their content is allowed under the policies of their payment processors linked to their account. On social media, users criticizing Itch.io’s decision noted that its current terms declare that adult content violations are “permanent with no chance of appeal” and that any funds in an offending account “will not be eligible for payout” — or as one developer put it, “If you violate the rules, we take all your money. Not just the money from that work, ALL your money from EVERYTHING you’ve ever made.” This is far from the first time that payment companies appear to have pressured online platforms over adult content — for example, last year Gumroad pointed to restrictions from payment processors when it implemented stricter rules around NSFW art, and OnlyFans also blamed “banking partners and payment providers” when it banned explicit content (a decision that it subsequently reversed). A Change.org petition with more than 137,000 verified signatures criticizes Mastercard and Visa for their role in these types of decisions. Among other things, the petition demands that the payment companies “stop censoring legal fictional content that complies with the law and p",
    "metadata": {
      "summary": "Indie video game marketplace Itch.io has deindexed adult and not-safe-for-work games following a campaign by Collective Shout, an advocacy group, and pressure from payment processors like PayPal, Mastercard, and Visa. This move, similar to past actions by Gumroad and OnlyFans, aims to protect Itch.io's payment infrastructure but has drawn criticism from developers over content policies and fund retention.",
      "keywords": [
        "Itch.io",
        "adult games",
        "NSFW content",
        "payment processors",
        "Collective Shout",
        "video game marketplace",
        "content moderation"
      ],
      "entities": [
        "Itch.io",
        "Steam",
        "Collective Shout",
        "PayPal",
        "Mastercard",
        "Visa",
        "Gumroad",
        "OnlyFans",
        "No Mercy",
        "Anthony Ha"
      ],
      "sentiment": -0.5,
      "category": "technology"
    },
    "entities": [],
    "processed_at": "2025-08-25 01:02:16.283051"
  },
  {
    "id": "techcrunch.com_2025_07_26_tesla-vet-says-that-reviewing-real-products-not-mockups-is-the-key-to-staying-innovative_",
    "url": "https://techcrunch.com/2025/07/26/tesla-vet-says-that-reviewing-real-products-not-mockups-is-the-key-to-staying-innovative/",
    "title": "Tesla vet says that 'reviewing real products' — not mock-ups — is the key to staying innovative | TechCrunch",
    "content": "Tesla vet says that 'reviewing real products' — not mock-ups — is the key to staying innovative | TechCrunch Tesla vet says that 'reviewing real products' — not mock-ups — is the key to staying innovative | TechCrunch TechCrunch Desktop Logo TechCrunch Mobile Logo LatestStartupsVentureAppleSecurityAIApps EventsPodcastsNewsletters SearchSubmit Site Search Toggle Mega Menu Toggle Topics Latest AI Amazon Apps Biotech & Health Climate Cloud Computing Commerce Crypto Enterprise EVs Fintech Fundraising Gadgets Gaming Google Government & Policy Hardware Instagram Layoffs Media & Entertainment Meta Microsoft Privacy Robotics Security Social Space Startups TikTok Transportation Venture More from TechCrunch Staff Events Startup Battlefield StrictlyVC Newsletters Podcasts Videos Partner Content TechCrunch Brand Studio Crunchboard Contact Us Image Credits:TechCrunch Transportation Tesla vet says that ‘reviewing real products’ — not mock-ups — is the key to staying innovative Tim De Chant 7:00 AM PDT · July 26, 2025 GM’s EVs have been on a roll lately. After selling just the Chevy Bolt for years, a wave of new models — now up to 17 fully electrified vehicles — has pushed the automaker into second place in the U.S. behind Tesla. How did it get there? With a little help from a Tesla veteran. GM board member Jon McNeill was president of Tesla during the development and introduction of the Model 3, a crucial period of the company’s growth. One of the things he credits for Tesla’s success is how Elon Musk ran product meetings. “No slides was our first rule,” McNeill told the audience earlier this month at TC All Stage in Boston. “You have to be reviewing real product.” Every week, senior leadership would sit down with product leaders to review their progress. The practice was inspired by an encounter Musk had with Steve Jobs, McNeill said. “There was this belief that I think is true: Steve Jobs didn’t have a ton of time or patience for Elon in the early days. And early in the early days, Elon would try to chase Steve down at events and parties in Silicon Valley for advice. And Steve didn’t like Elon, and so would often turn his back to him when he approached him. “But one night, Elon got lucky and said, ‘Steve, if you had one piece of advice for me as a young entrepreneur’ — he had just done PayPal and was joining the team at Tesla — ‘what would that be?’ Steve said, ‘Elon, you’re now in the hardware business, but the hardware business is a lot like the software business. If you want to be successful in business, you have to get one thing right, and that is, you have to have a perfect product. And if the product is beautiful, it will sell itself.’” Techcrunch event Tech and VC heavyweights join the Disrupt 2025 agenda Netflix, ElevenLabs, Wayve, Sequoia Capital, Elad Gil — just a few of the heavy hitters joining the Disrupt 2025 agenda. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $600+ before prices rise. Tech and VC heavyweights join the Disrupt 2025 agenda Netflix, ElevenLabs, Wayve, Sequoia Capital — just a few of the heavy hitters joining the Disrupt 2025 agenda. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise. San Francisco | October 27-29, 2025 REGISTER NOW Musk took that to heart, McNeill said, and the concept of a perfect product became central to product development at Tesla. “The thing we were looking for first of all was surprise and delight. Like, are we doing something that is going to just make somebody go wow or laugh or have fun? “Crazy example of that is the fart button,” McNeill said, referring to a software button labeled “Emissions Testing Mode” that would simulate flatulence through the car’s speakers. The company also prized minimalism, which on the software side meant keeping functions accessible in fewer than two taps on the screen. “It has to be a kind of a no-brainer for the average user. Then we would double back the designer — the lead designer was always in the room — and then we would say, OK, Franz, now make it beautiful.” Meetings like those, where the actual product was reviewed, not a mock-up, helped preserve Tesla’s culture as it grew, McNeill said. “You can imagine the culture that gets communicated when people are bringing their A game to the CEO every week. Because you’re not going to bring your B game to the CEO — especially that CEO, because he’s going to fire you,” he said. “That keeps that company on a one-week cadence of innovation. Every week they’re making progress because of the product reviews.” McNeill left Tesla in early 2018. In 2022, he was added to the board at GM. “One of the things I’m most ",
    "metadata": {
      "summary": "Former Tesla president Jon McNeill reveals that Elon Musk's emphasis on reviewing real products, not mock-ups, was key to Tesla's innovation, a practice inspired by Steve Jobs. This approach, focused on creating \"perfect products\" that surprise and delight users with minimalism and beauty, fostered a culture of continuous weekly innovation. McNeill, now a GM board member, highlights how this method drove progress and maintained high standards within Tesla.",
      "keywords": [
        "Tesla",
        "innovation",
        "product development",
        "Elon Musk",
        "Jon McNeill",
        "Steve Jobs",
        "product reviews"
      ],
      "entities": [
        "Jon McNeill",
        "Elon Musk",
        "Steve Jobs",
        "Tesla",
        "GM",
        "TechCrunch",
        "Model 3",
        "TechCrunch Disrupt",
        "Silicon Valley",
        "San Francisco"
      ],
      "sentiment": 0.8,
      "category": "technology"
    },
    "entities": [],
    "processed_at": "2025-08-25 01:02:21.612447"
  },
  {
    "id": "techcrunch.com_2025_07_25_meta-names-shengjia-zhao-as-chief-scientist-of-ai-superintelligence-unit_",
    "url": "https://techcrunch.com/2025/07/25/meta-names-shengjia-zhao-as-chief-scientist-of-ai-superintelligence-unit/",
    "title": "Meta names Shengjia Zhao as chief scientist of AI superintelligence unit | TechCrunch",
    "content": "Meta names Shengjia Zhao as chief scientist of AI superintelligence unit | TechCrunch Meta names Shengjia Zhao as chief scientist of AI superintelligence unit | TechCrunch TechCrunch Desktop Logo TechCrunch Mobile Logo LatestStartupsVentureAppleSecurityAIApps EventsPodcastsNewsletters SearchSubmit Site Search Toggle Mega Menu Toggle Topics Latest AI Amazon Apps Biotech & Health Climate Cloud Computing Commerce Crypto Enterprise EVs Fintech Fundraising Gadgets Gaming Google Government & Policy Hardware Instagram Layoffs Media & Entertainment Meta Microsoft Privacy Robotics Security Social Space Startups TikTok Transportation Venture More from TechCrunch Staff Events Startup Battlefield StrictlyVC Newsletters Podcasts Videos Partner Content TechCrunch Brand Studio Crunchboard Contact Us Image Credits:David Paul Morris/Bloomberg / Getty Images AI Meta names Shengjia Zhao as chief scientist of AI superintelligence unit Maxwell Zeff 1:58 PM PDT · July 25, 2025 Meta CEO Mark Zuckerberg announced Friday that former OpenAI researcher Shengjia Zhao will lead research efforts at the company’s new AI unit, Meta Superintelligence Labs (MSL). Zhao contributed to several of OpenAI’s largest breakthroughs, including ChatGPT, GPT-4, and the company’s first AI reasoning model, o1. “I’m excited to share that Shengjia Zhao will be the Chief Scientist of Meta Superintelligence Labs,” Zuckerberg said in a post on Threads Friday. “Shengjia co-founded the new lab and has been our lead scientist from day one. Now that our recruiting is going well and our team is coming together, we have decided to formalize his leadership role.” Zhao will set a research agenda for MSL under the leadership of Alexandr Wang, the former CEO of Scale AI who was recently hired to lead the new unit. We are excited to announce that @shengjia_zhao will be the Chief Scientist of Meta Superintelligence Labs!Shengjia is a brilliant scientist who most recently pioneered a new scaling paradigm in his research. He will lead our scientific direction for our team.Let's go 🚀 pic.twitter.com/D93KQWIvFl— Alexandr Wang (@alexandr_wang) July 25, 2025 Wang, who does not have a research background, was viewed as a somewhat unconventional choice to lead an AI lab. The addition of Zhao, who is a reputable research leader known for developing frontier AI models, rounds out the leadership team. To further fill out the unit, Meta has hired several high-level researchers from OpenAI, Google DeepMind, Safe Superintelligence, Apple, and Anthropic, as well as pulling researchers from Meta’s existing Fundamental AI Research (FAIR) lab and generative AI unit. Zuckerberg notes in his post that Zhao has pioneered several breakthroughs, including a “new scaling paradigm.” The Meta CEO is likely referencing Zhao’s work on OpenAI’s reasoning model, o1, in which he is listed as a foundational contributor alongside OpenAI co-founder Ilya Sutskever. Meta currently doesn’t offer a competitor to o1, so AI reasoning models are a key area of focus for MSL. The Information reported in June that Zhao would be joining Meta Superintelligence Labs, alongside three other influential OpenAI researchers — Jiahui Yu, Shuchao Bi, and Hongyu Ren. Meta has also recruited Trapit Bansal, another OpenAI researcher who worked on AI reasoning models with Zhao, as well as three employees from OpenAI’s Zurich office who worked on multimodality. Zuckerberg has gone to great lengths to set MSL up for success. The Meta CEO has been on a recruiting spree to staff up his AI superintelligence lab, which has entailed sending personal emails to researchers and inviting prospects to his Lake Tahoe estate. Meta has reportedly offered some researchers eight- and nine-figure compensation packages, some of which are “exploding offers” that expire in a matter of days. Techcrunch event Tech and VC heavyweights join the Disrupt 2025 agenda Netflix, ElevenLabs, Wayve, Sequoia Capital, Elad Gil — just a few of the heavy hitters joining the Disrupt 2025 agenda. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $600+ before prices rise. Tech and VC heavyweights join the Disrupt 2025 agenda Netflix, ElevenLabs, Wayve, Sequoia Capital — just a few of the heavy hitters joining the Disrupt 2025 agenda. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise. San Francisco | October 27-29, 2025 REGISTER NOW Meta has also upped its investment in cloud computing infrastructure, which should help MSL conduct the massive training runs required to create competitive frontier AI models. By 2026, Zhao and MSL’s researchers should have access to Meta’s 1 gigawatt cloud computi",
    "metadata": {
      "summary": "Meta has appointed Shengjia Zhao, a former OpenAI researcher known for his work on models like ChatGPT and GPT-4, as the chief scientist of its new AI Superintelligence Labs (MSL). Zhao will set the research agenda for MSL, which has been aggressively recruiting top talent from other leading AI companies like Google DeepMind and Apple. This strategic move highlights Meta's significant investment in developing frontier AI models and strengthening its position in the AI landscape.",
      "keywords": [
        "Meta",
        "Shengjia Zhao",
        "AI",
        "Superintelligence Labs",
        "OpenAI",
        "Mark Zuckerberg",
        "AI research"
      ],
      "entities": [
        "Shengjia Zhao",
        "Meta",
        "OpenAI",
        "Mark Zuckerberg",
        "Meta Superintelligence Labs",
        "Alexandr Wang",
        "ChatGPT",
        "GPT-4",
        "Google DeepMind",
        "TechCrunch"
      ],
      "sentiment": 0.75,
      "category": "technology"
    },
    "entities": [],
    "processed_at": "2025-08-25 01:02:27.191130"
  },
  {
    "id": "techcrunch.com_2025_07_26_dating-safety-app-tea-breached-exposing-72000-user-images_",
    "url": "https://techcrunch.com/2025/07/26/dating-safety-app-tea-breached-exposing-72000-user-images/",
    "title": "Dating safety app Tea breached, exposing 72,000 user images | TechCrunch",
    "content": "Dating safety app Tea breached, exposing 72,000 user images | TechCrunch Dating safety app Tea breached, exposing 72,000 user images | TechCrunch TechCrunch Desktop Logo TechCrunch Mobile Logo LatestStartupsVentureAppleSecurityAIApps EventsPodcastsNewsletters SearchSubmit Site Search Toggle Mega Menu Toggle Topics Latest AI Amazon Apps Biotech & Health Climate Cloud Computing Commerce Crypto Enterprise EVs Fintech Fundraising Gadgets Gaming Google Government & Policy Hardware Instagram Layoffs Media & Entertainment Meta Microsoft Privacy Robotics Security Social Space Startups TikTok Transportation Venture More from TechCrunch Staff Events Startup Battlefield StrictlyVC Newsletters Podcasts Videos Partner Content TechCrunch Brand Studio Crunchboard Contact Us In Brief Posted: 9:40 AM PDT · July 26, 2025 Image Credits:Tea Anthony Ha Dating safety app Tea breached, exposing 72,000 user images Tea, an app that allows women to post anonymous comments about men they’ve supposedly dated, announced Friday that it has suffered a data breach, with hackers gaining access to 72,000 images. That number includes 13,000 selfies and photo IDs submitted for account verification, as well as 59,000 images from posts, comments, and direct messages, the company said. Tea also said that no emails or phone numbers were exposed, and that only users who signed up before February 2024 were affected. “We have engaged third-party cybersecurity experts and are working around the clock to secure our systems,” the company said. “At this time, we have implemented additional security measures and have fixed the data issue.” 404 Media reported that 4chan users claimed to be sharing personal data and selfies from Tea after discovering an exposed database. The hack comes after the Tea app seemed to achieve viral popularity this week. As of Saturday morning, it was still No. 1 in the free app rankings in Apple’s App Store. Topics Apps, data breach, In Brief, Security, Social, Startups, tea October 27-29, 2025 San Francisco Put your brand in front of 10,000+ tech and VC leaders across all three days of Disrupt 2025. Amplify your reach, spark real connections, and lead the innovation charge. Secure your exhibit space before your competitor does. Book Your Table Newsletters See More Subscribe for the industry’s biggest tech news TechCrunch Daily News Every weekday and Sunday, you can get the best of TechCrunch’s coverage. TechCrunch Mobility TechCrunch Mobility is your destination for transportation news and insight. Startups Weekly Startups are the core of TechCrunch, so get our best coverage delivered weekly. StrictlyVC Provides movers and shakers with the info they need to start their day. No newsletters selected. Subscribe By submitting your email, you agree to our Terms and Privacy Notice. Related Transportation TechCrunch Mobility: Waymo’s Big Apple score and Nvidia backs Nuro Kirsten Korosec 2 hours ago Hardware iPhone 17, the ‘thinnest iPhone ever,’ and everything else we’re expecting out of Apple’s hardware event Lauren Forristal 6 hours ago Government & Policy The Trump administration’s big Intel investment comes from already awarded grants Anthony Ha 1 day ago Latest in Security In Brief Developer gets prison time for sabotaging former employer’s network with a ‘kill switch’ Zack Whittaker 2 days ago Security Hackers who exposed North Korean government hacker explain why they did it Lorenzo Franceschi-Bicchierai 3 days ago In Brief Device searches at the US border hit record high, new data shows Zack Whittaker 4 days ago X LinkedIn Facebook Instagram youTube Mastodon Threads Bluesky TechCrunchStaffContact UsAdvertiseCrunchboard JobsSite Map Terms of ServicePrivacy PolicyRSS Terms of UseCode of Conduct Pixel 10Made by GoogleGrokMeta SolarGPT-5Tech LayoffsChatGPT © 2025 TechCrunch Media LLC.",
    "metadata": {
      "summary": "The dating safety app Tea experienced a data breach, exposing 72,000 user images, including selfies and photo IDs. The company has engaged cybersecurity experts and implemented additional security measures, stating that only users who signed up before February 2024 were affected and no emails or phone numbers were compromised. This breach occurred shortly after the app gained viral popularity, reaching the top of Apple's App Store free app rankings.",
      "keywords": [
        "data breach",
        "dating app",
        "Tea app",
        "cybersecurity",
        "user images",
        "privacy",
        "TechCrunch"
      ],
      "entities": [
        "Tea",
        "TechCrunch",
        "Apple",
        "App Store",
        "404 Media",
        "4chan",
        "Anthony Ha",
        "Disrupt 2025",
        "San Francisco"
      ],
      "sentiment": -0.8,
      "category": "technology"
    },
    "entities": [],
    "processed_at": "2025-08-25 01:02:31.849089"
  },
  {
    "id": "techcrunch.com_2025_07_25_sam-altman-warns-theres-no-legal-confidentiality-when-using-chatgpt-as-a-therapist_",
    "url": "https://techcrunch.com/2025/07/25/sam-altman-warns-theres-no-legal-confidentiality-when-using-chatgpt-as-a-therapist/",
    "title": "Sam Altman warns there's no legal confidentiality when using ChatGPT as a therapist | TechCrunch",
    "content": "Sam Altman warns there's no legal confidentiality when using ChatGPT as a therapist | TechCrunch Sam Altman warns there's no legal confidentiality when using ChatGPT as a therapist | TechCrunch TechCrunch Desktop Logo TechCrunch Mobile Logo LatestStartupsVentureAppleSecurityAIApps EventsPodcastsNewsletters SearchSubmit Site Search Toggle Mega Menu Toggle Topics Latest AI Amazon Apps Biotech & Health Climate Cloud Computing Commerce Crypto Enterprise EVs Fintech Fundraising Gadgets Gaming Google Government & Policy Hardware Instagram Layoffs Media & Entertainment Meta Microsoft Privacy Robotics Security Social Space Startups TikTok Transportation Venture More from TechCrunch Staff Events Startup Battlefield StrictlyVC Newsletters Podcasts Videos Partner Content TechCrunch Brand Studio Crunchboard Contact Us Image Credits:This Past Weekend w/ Theo Von #599 (opens in a new window) AI Sam Altman warns there’s no legal confidentiality when using ChatGPT as a therapist Sarah Perez 10:33 AM PDT · July 25, 2025 ChatGPT users may want to think twice before turning to their AI app for therapy or other kinds of emotional support. According to OpenAI CEO Sam Altman, the AI industry hasn’t yet figured out how to protect user privacy when it comes to these more sensitive conversations, because there’s no doctor-patient confidentiality when your doc is an AI. The exec made these comments on a recent episode of Theo Von’s podcast, This Past Weekend w/ Theo Von. In response to a question about how AI works with today’s legal system, Altman said one of the problems of not yet having a legal or policy framework for AI is that there’s no legal confidentiality for users’ conversations. “People talk about the most personal sh** in their lives to ChatGPT,” Altman said. “People use it — young people, especially, use it — as a therapist, a life coach; having these relationship problems and [asking] ‘what should I do?’ And right now, if you talk to a therapist or a lawyer or a doctor about those problems, there’s legal privilege for it. There’s doctor-patient confidentiality, there’s legal confidentiality, whatever. And we haven’t figured that out yet for when you talk to ChatGPT.” This could create a privacy concern for users in the case of a lawsuit, Altman added, because OpenAI would be legally required to produce those conversations today. “I think that’s very screwed up. I think we should have the same concept of privacy for your conversations with AI that we do with a therapist or whatever — and no one had to think about that even a year ago,” Altman said. The company understands that the lack of privacy could be a blocker to broader user adoption. In addition to AI’s demand for so much online data during the training period, it’s being asked to produce data from users’ chats in some legal contexts. Already, OpenAI has been fighting a court order in its lawsuit with The New York Times, which would require it to save the chats of hundreds of millions of ChatGPT users globally, excluding those from ChatGPT Enterprise customers. Techcrunch event Tech and VC heavyweights join the Disrupt 2025 agenda Netflix, ElevenLabs, Wayve, Sequoia Capital, Elad Gil — just a few of the heavy hitters joining the Disrupt 2025 agenda. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $600+ before prices rise. Tech and VC heavyweights join the Disrupt 2025 agenda Netflix, ElevenLabs, Wayve, Sequoia Capital — just a few of the heavy hitters joining the Disrupt 2025 agenda. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise. San Francisco | October 27-29, 2025 REGISTER NOW In a statement on its website, OpenAI said it’s appealing this order, which it called “an overreach.” If the court could override OpenAI’s own decisions around data privacy, it could open the company to further demand for legal discovery or law enforcement purposes. Today’s tech companies are regularly subpoenaed for user data in order to aid in criminal prosecutions. But in more recent years, there have been additional concerns about digital data as laws began limiting access to previously established freedoms, like a woman’s right to choose. When the Supreme Court overturned Roe v. Wade, for example, customers began switching to more private period-tracking apps or to Apple Health, which encrypted their records. Altman asked the podcast host about his own ChatGPT usage, as well, given that Von said he didn’t talk to the AI chatbot much due to his own privacy concerns. “I think it makes sense … to really want the privacy clarity before you use [ChatGPT] a lot — like the legal clarity,” Altman said. Topics AI,",
    "metadata": {
      "summary": "Sam Altman, CEO of OpenAI, warns that there is no legal confidentiality for user conversations when using ChatGPT as a therapist or for emotional support. This lack of a legal framework means that OpenAI could be compelled to produce user chat data in a lawsuit, raising significant privacy concerns. Altman believes that AI conversations should have the same privacy protections as those with human therapists, lawyers, or doctors.",
      "keywords": [
        "ChatGPT",
        "AI privacy",
        "data confidentiality",
        "OpenAI",
        "Sam Altman",
        "digital therapy",
        "legal framework"
      ],
      "entities": [
        "Sam Altman",
        "ChatGPT",
        "OpenAI",
        "TechCrunch",
        "Theo Von",
        "The New York Times",
        "Apple Health",
        "TechCrunch Disrupt",
        "Netflix",
        "Sequoia Capital",
        "San Francisco"
      ],
      "sentiment": -0.3,
      "category": "technology"
    },
    "entities": [],
    "processed_at": "2025-08-25 01:02:35.625064"
  },
  {
    "id": "techcrunch.com_2025_07_25_intel-is-spinning-off-its-network-and-edge-group_",
    "url": "https://techcrunch.com/2025/07/25/intel-is-spinning-off-its-network-and-edge-group/",
    "title": "Intel is spinning off its Network and Edge group | TechCrunch",
    "content": "Intel is spinning off its Network and Edge group | TechCrunch Intel is spinning off its Network and Edge group | TechCrunch TechCrunch Desktop Logo TechCrunch Mobile Logo LatestStartupsVentureAppleSecurityAIApps EventsPodcastsNewsletters SearchSubmit Site Search Toggle Mega Menu Toggle Topics Latest AI Amazon Apps Biotech & Health Climate Cloud Computing Commerce Crypto Enterprise EVs Fintech Fundraising Gadgets Gaming Google Government & Policy Hardware Instagram Layoffs Media & Entertainment Meta Microsoft Privacy Robotics Security Social Space Startups TikTok Transportation Venture More from TechCrunch Staff Events Startup Battlefield StrictlyVC Newsletters Podcasts Videos Partner Content TechCrunch Brand Studio Crunchboard Contact Us In Brief Posted: 2:34 PM PDT · July 25, 2025 Image Credits:hapabapa / Getty Images Rebecca Szkutak Intel is spinning off its Network and Edge group Intel continues to streamline its business. The company plans to spin off its Network and Edge group, which is responsible for making chips for the telecom industry, as originally reported by CRN. Intel will be an anchor investor in the stand-alone business and will seek outside capital. Intel was rumored to be looking for a buyer for its Network and Edge group in May. This business produced $5.8 billion in revenue in 2024. This strategy seems similar to the company’s decision to spin off RealSense, its former stereoscopic imaging technology business, earlier this month. Intel decided to spin RealSense out during former CEO Pat Gelsinger’s tenure and the company struck out on its own with $50 million in venture funding. TechCrunch reached out for more information about its plans and timeline for the spinout. Topics Enterprise, Intel, semiconductor, United States October 27-29, 2025 San Francisco Put your brand in front of 10,000+ tech and VC leaders across all three days of Disrupt 2025. Amplify your reach, spark real connections, and lead the innovation charge. Secure your exhibit space before your competitor does. Book Your Table Newsletters See More Subscribe for the industry’s biggest tech news TechCrunch Daily News Every weekday and Sunday, you can get the best of TechCrunch’s coverage. TechCrunch Mobility TechCrunch Mobility is your destination for transportation news and insight. Startups Weekly Startups are the core of TechCrunch, so get our best coverage delivered weekly. StrictlyVC Provides movers and shakers with the info they need to start their day. No newsletters selected. Subscribe By submitting your email, you agree to our Terms and Privacy Notice. Related Government & Policy The Trump administration’s big Intel investment comes from already awarded grants Anthony Ha 1 day ago AI Coinbase CEO explains why he fired engineers who didn’t try AI immediately Julie Bort 2 days ago Enterprise US government plans to take a 10% stake in Intel Kirsten Korosec 2 days ago Latest in Enterprise AI Coinbase CEO explains why he fired engineers who didn’t try AI immediately Julie Bort 2 days ago Enterprise Apple gets ready for AI in the enterprise with new ChatGPT configuration options Sarah Perez 2 days ago Enterprise US government plans to take a 10% stake in Intel Kirsten Korosec 2 days ago X LinkedIn Facebook Instagram youTube Mastodon Threads Bluesky TechCrunchStaffContact UsAdvertiseCrunchboard JobsSite Map Terms of ServicePrivacy PolicyRSS Terms of UseCode of Conduct Pixel 10Made by GoogleGrokMeta SolarGPT-5Tech LayoffsChatGPT © 2025 TechCrunch Media LLC.",
    "metadata": {
      "summary": "Intel is spinning off its Network and Edge group, which produces chips for the telecom industry, as part of a business streamlining strategy. The company will remain an anchor investor in the new stand-alone entity and plans to seek external funding, similar to its prior spin-off of RealSense.",
      "keywords": [
        "Intel",
        "spin-off",
        "Network and Edge group",
        "telecom industry",
        "business strategy",
        "RealSense",
        "semiconductor"
      ],
      "entities": [
        "Intel",
        "Network and Edge group",
        "TechCrunch",
        "CRN",
        "RealSense",
        "Pat Gelsinger",
        "United States"
      ],
      "sentiment": 0.1,
      "category": "technology"
    },
    "entities": [],
    "processed_at": "2025-08-25 01:02:39.805005"
  },
  {
    "id": "techcrunch.com_2025_07_27_wizard-of-oz-blown-up-by-ai-for-giant-sphere-screen_",
    "url": "https://techcrunch.com/2025/07/27/wizard-of-oz-blown-up-by-ai-for-giant-sphere-screen/",
    "title": "‘The Wizard of Oz’ blown up by AI for giant Sphere screen | TechCrunch",
    "content": "‘The Wizard of Oz’ blown up by AI for giant Sphere screen | TechCrunch ‘The Wizard of Oz’ blown up by AI for giant Sphere screen | TechCrunch TechCrunch Desktop Logo TechCrunch Mobile Logo LatestStartupsVentureAppleSecurityAIApps EventsPodcastsNewsletters SearchSubmit Site Search Toggle Mega Menu Toggle Topics Latest AI Amazon Apps Biotech & Health Climate Cloud Computing Commerce Crypto Enterprise EVs Fintech Fundraising Gadgets Gaming Google Government & Policy Hardware Instagram Layoffs Media & Entertainment Meta Microsoft Privacy Robotics Security Social Space Startups TikTok Transportation Venture More from TechCrunch Staff Events Startup Battlefield StrictlyVC Newsletters Podcasts Videos Partner Content TechCrunch Brand Studio Crunchboard Contact Us In Brief Posted: 12:49 PM PDT · July 27, 2025 Image Credits:CBS Sunday Morning Anthony Ha ‘The Wizard of Oz’ blown up by AI for giant Sphere screen The massive Las Vegas venue known as Sphere will be screening its first classic movie, “The Wizard of Oz,” starting on August 28. And as detailed in a segment on CBS Sunday Morning, this isn’t just a matter of taking the existing movie and projecting it on Sphere’s 160,000-square-foot, wraparound LED screen. Instead, Sphere Entertainment CEO James Dolan said a 2,000-person team is creating a new experience. That includes using AI to both increase the resolution of the existing film and expand the footage beyond the frame of what was actually shot. For example, Turner Classic Movie presenter Ben Mankiewicz said that through the use of AI, “a grainy close-up of Dorothy becomes richly detailed, and then through a process called outpainting — though it seems like magic — we see the rest of the Scarecrow, the Yellow Brick Road, and the mountains of Oz.” In other cases, expanding the frame means creating new performances from the existing actors. Despite these changes, Dolan said, “Our standard on this was not to modify the film at all but to try and bring you into the film, as if you were in the studio when it was shot.” Topics AI, In Brief, Media & Entertainment, Sphere, wizard of oz October 27-29, 2025 San Francisco Put your brand in front of 10,000+ tech and VC leaders across all three days of Disrupt 2025. Amplify your reach, spark real connections, and lead the innovation charge. Secure your exhibit space before your competitor does. Book Your Table Newsletters See More Subscribe for the industry’s biggest tech news TechCrunch Daily News Every weekday and Sunday, you can get the best of TechCrunch’s coverage. TechCrunch Mobility TechCrunch Mobility is your destination for transportation news and insight. Startups Weekly Startups are the core of TechCrunch, so get our best coverage delivered weekly. StrictlyVC Provides movers and shakers with the info they need to start their day. No newsletters selected. Subscribe By submitting your email, you agree to our Terms and Privacy Notice. Related Transportation TechCrunch Mobility: Waymo’s Big Apple score and Nvidia backs Nuro Kirsten Korosec 2 hours ago Hardware iPhone 17, the ‘thinnest iPhone ever,’ and everything else we’re expecting out of Apple’s hardware event Lauren Forristal 6 hours ago Government & Policy The Trump administration’s big Intel investment comes from already awarded grants Anthony Ha 1 day ago Latest in Media & Entertainment Media & Entertainment Apple TV+ price jumps 30% to $12.99 monthly Aisha Malik 3 days ago Media & Entertainment YouTube Music celebrates 10 years with new features that help it compete with Spotify Sarah Perez 3 days ago Hardware Google, sorry, but that Pixel event was a cringefest Sarah Perez 4 days ago X LinkedIn Facebook Instagram youTube Mastodon Threads Bluesky TechCrunchStaffContact UsAdvertiseCrunchboard JobsSite Map Terms of ServicePrivacy PolicyRSS Terms of UseCode of Conduct Pixel 10Made by GoogleGrokMeta SolarGPT-5Tech LayoffsChatGPT © 2025 TechCrunch Media LLC.",
    "metadata": {
      "summary": "The classic film 'The Wizard of Oz' is being reimagined for the massive Sphere screen in Las Vegas, starting August 28. A 2,000-person team is using AI to increase the film's resolution and expand its footage beyond the original frame, including a technique called 'outpainting' to create new visual elements. This ambitious project aims to immerse viewers into the film without modifying its original integrity.",
      "keywords": [
        "AI film enhancement",
        "Sphere Las Vegas",
        "The Wizard of Oz",
        "movie adaptation",
        "outpainting",
        "immersive experience"
      ],
      "entities": [
        "The Wizard of Oz",
        "Sphere",
        "AI",
        "Las Vegas",
        "James Dolan",
        "Ben Mankiewicz",
        "CBS Sunday Morning",
        "Sphere Entertainment"
      ],
      "sentiment": 0.8,
      "category": "technology"
    },
    "entities": [],
    "processed_at": "2025-08-25 01:02:44.322214"
  },
  {
    "id": "techcrunch.com_2025_07_27_doge-has-built-an-ai-tool-to-slash-federal-regulations_",
    "url": "https://techcrunch.com/2025/07/27/doge-has-built-an-ai-tool-to-slash-federal-regulations/",
    "title": "DOGE has built an AI tool to slash federal regulations | TechCrunch",
    "content": "DOGE has built an AI tool to slash federal regulations | TechCrunch DOGE has built an AI tool to slash federal regulations | TechCrunch TechCrunch Desktop Logo TechCrunch Mobile Logo LatestStartupsVentureAppleSecurityAIApps EventsPodcastsNewsletters SearchSubmit Site Search Toggle Mega Menu Toggle Topics Latest AI Amazon Apps Biotech & Health Climate Cloud Computing Commerce Crypto Enterprise EVs Fintech Fundraising Gadgets Gaming Google Government & Policy Hardware Instagram Layoffs Media & Entertainment Meta Microsoft Privacy Robotics Security Social Space Startups TikTok Transportation Venture More from TechCrunch Staff Events Startup Battlefield StrictlyVC Newsletters Podcasts Videos Partner Content TechCrunch Brand Studio Crunchboard Contact Us In Brief Posted: 7:39 AM PDT · July 27, 2025 Image Credits:Andrew Harnik / Getty Images Anthony Ha DOGE has built an AI tool to slash federal regulations The Department of Government Efficiency hopes to use a new AI tool to eliminate half of the federal government’s regulatory mandates, according to The Washington Post. Citing a PowerPoint presentation dated July 1, The Post reports that the DOGE AI Deregulation Decision Tool is supposed to analyze around 200,000 federal regulations and identify the ones that are no longer required by law, with the goal of eliminating half those regulations by the first anniversary of President Donald Trump’s return to office. It seems this work is already underway, with the presentation declaring the tool has already been used to review regulations at the Department of Housing and Urban Development and to write “100% of deregulations” at the Consumer Financial Protection Bureau. A White House spokesperson told The Post that “no single plan has been approved or greenlit” but praised the DOGE team as “the best and brightest in the business.” This is just the latest AI tool developed by DOGE (led in the early months of the Trump administration by Elon Musk), including one reportedly error-prone tool that would hallucinate the size of Veterans Affairs contracts. Topics AI, doge, Donald Trump, Elon Musk, Government & Policy, In Brief October 27-29, 2025 San Francisco Put your brand in front of 10,000+ tech and VC leaders across all three days of Disrupt 2025. Amplify your reach, spark real connections, and lead the innovation charge. Secure your exhibit space before your competitor does. Book Your Table Newsletters See More Subscribe for the industry’s biggest tech news TechCrunch Daily News Every weekday and Sunday, you can get the best of TechCrunch’s coverage. TechCrunch Mobility TechCrunch Mobility is your destination for transportation news and insight. Startups Weekly Startups are the core of TechCrunch, so get our best coverage delivered weekly. StrictlyVC Provides movers and shakers with the info they need to start their day. No newsletters selected. Subscribe By submitting your email, you agree to our Terms and Privacy Notice. Related Government & Policy The Trump administration’s big Intel investment comes from already awarded grants Anthony Ha 1 day ago Latest in Government & Policy Social Bluesky blocks service in Mississippi over age assurance law Sarah Perez 1 hour ago In Brief Former Meta exec Nick Clegg offers careful criticism of ‘cloyingly conformist’ Silicon Valley Anthony Ha 1 hour ago Government & Policy The Trump administration’s big Intel investment comes from already awarded grants Anthony Ha 1 day ago X LinkedIn Facebook Instagram youTube Mastodon Threads Bluesky TechCrunchStaffContact UsAdvertiseCrunchboard JobsSite Map Terms of ServicePrivacy PolicyRSS Terms of UseCode of Conduct Pixel 10Made by GoogleGrokMeta SolarGPT-5Tech LayoffsChatGPT © 2025 TechCrunch Media LLC.",
    "metadata": {
      "summary": "The Department of Government Efficiency (DOGE) has developed an AI tool aimed at eliminating half of the federal government's 200,000 regulatory mandates by the first anniversary of President Donald Trump's return to office. While a White House spokesperson stated no plan has been approved, the tool is reportedly already in use at departments like Housing and Urban Development and the Consumer Financial Protection Bureau, despite a previous error-prone AI tool from DOGE led by Elon Musk.",
      "keywords": [
        "AI",
        "federal regulations",
        "government efficiency",
        "Donald Trump",
        "DOGE",
        "deregulation",
        "policy"
      ],
      "entities": [
        "Donald Trump",
        "Elon Musk",
        "Department of Government Efficiency (DOGE)",
        "The Washington Post",
        "Department of Housing and Urban Development",
        "Consumer Financial Protection Bureau",
        "White House",
        "TechCrunch",
        "AI Deregulation Decision Tool"
      ],
      "sentiment": 0.1,
      "category": "politics"
    },
    "entities": [],
    "processed_at": "2025-08-25 01:02:51.313848"
  },
  {
    "id": "edition.cnn.com_2025_07_27_business_us-china-trade-talks-stockholm-intl-hnk",
    "url": "https://edition.cnn.com/2025/07/27/business/us-china-trade-talks-stockholm-intl-hnk",
    "title": "Clock is ticking for a US-China trade deal. Negotiators are meeting to buy more time | CNN Business",
    "content": "Clock is ticking for a US-China trade deal. Negotiators are meeting to buy more time | CNN Business Ad Feedback CNN values your feedback 1. How relevant is this ad to you? 2. Did you encounter any technical issues? Video player was slow to load content Video content never loaded Ad froze or did not finish loading Video content did not start after ad Audio on ad was too loud Other issues Ad never loaded Ad prevented/slowed the page from loading Content moved around while ad loaded Ad was repetitive to ads I've seen previously Other issues Cancel Submit Thank You! Your effort and contribution in providing this feedback is much appreciated. Close Close icon Business Markets Tech Media Calculators Videos More Markets Tech Media Calculators Videos Watch Listen Live TV Subscribe Sign in My Account Settings Newsletters Topics you follow Sign out Your CNN account Sign in to your CNN account Sign in My Account Settings Newsletters Topics you follow Sign out Your CNN account Sign in to your CNN account Live TV Listen Watch Edition US International Arabic Español Edition US International Arabic Español Markets Tech Media Calculators Videos Follow CNN Business World Africa Americas Asia Australia China Europe India Middle East United Kingdom US Politics Trump Facts First CNN Polls 2025 Elections Business Tech Media Calculators Videos Markets Pre-markets After-Hours Fear & Greed Investing Markets Now Nightcap Health Life, But Better Fitness Food Sleep Mindfulness Relationships Entertainment Movies Television Celebrity Tech Innovate Foreseeable Future Mission: Ahead Work Transformed Innovative Cities Style Arts Design Fashion Architecture Luxury Beauty Video Travel Destinations Food & Drink Stay News Videos Sports Football Tennis Golf Motorsport US Sports Olympics Climbing Esports Hockey Science Space Life Unearthed Climate Solutions Weather Weather Video Climate Ukraine-Russia War Israel-Hamas War Features As Equals Call to Earth Freedom Project Impact Your World Inside Africa CNN Heroes Watch Live TV CNN Fast Shows A-Z CNN10 CNN Max CNN TV Schedules Listen CNN 5 Things Chasing Life with Dr. Sanjay Gupta The Assignment with Audie Cornish One Thing Tug of War CNN Political Briefing The Axe Files All There Is with Anderson Cooper All CNN Audio podcasts Games Daily Crossword Jumble Crossword Photo Shuffle Sudoblock Sudoku 5 Things Quiz About CNN Photos Investigations CNN Profiles CNN Leadership CNN Newsletters Work for CNN Markets DOW S&P 500 NASDAQ Hot Stocks Fear & Greed Index ----- is driving the US market Latest Market News info The top numbered articles will be viewable to readers when programmed onto a page. Make sure you have 30 or more cards added to the container for the machine learning (ML) feature to work. Your queued up articles, seen in the violet section, will use ML to surface up relevant content to the reader based on their individual interests and preferences. People love their fake Labubus. Can Pop Mart keep up? Small businesses are scrambling as US tariff exemption comes to an end ‘Sneakflation’: How Trump’s tariffs are gradually raising costs for American consumers Hot Stocks ----- is driving the US market Something isn't loading properly. Please check back later. Ad Feedback Ad Feedback Business • 7 min read Clock is ticking for a US-China trade deal. Negotiators are meeting to buy more time By John Liu, Nectar Gan Updated Jul 28, 2025, 3:01 AM ET PUBLISHED Jul 27, 2025, 12:28 AM ET Chinese and US flags wave outside a technology company in Beijing on April 17, 2025. Pedro Pardo/AFP/Getty Images Asia China Tariffs Donald Trump See all topics Facebook Tweet Email Link Link Copied! Follow Hong Kong — The United States and China are poised to start a fresh round of talks in Sweden, aiming to extend a temporary trade truce that held back triple-digit tariffs while the world’s two biggest economies try to broker a lasting deal. Delegations led by US Treasury Secretary Scott Bessent and Chinese Vice Premier He Lifeng will convene in Stockholm on Monday before the current deadline expires on August 12. Ahead of the talks, Bessent said an extension is “likely” and that “trade is in a very good place with China.” It will be the rivals’ third European get-together in as many months, during which they have alternately feuded and negotiated, after slapping each other with sky-high tariffs that threatened to cut off all trade. Washington and Beijing reached a 90-day truce at a May meeting in Geneva, then pulled it back from the brink of collapse with further talks in London in June. The Stockholm talks may offer clues as to how much longer that detente can hold – and whether the two countries can further bring down remaining tariffs and address other thorny issues such as tech restrictions. They follow US President Donald Trump’s recent flurry of trade deals with the United Kingdom, Japan, the European Union, and other trade partners, part of the global tariff war he launched earlier this year. Beijing has emerged ",
    "metadata": {
      "summary": "The United States and China are holding a new round of trade talks in Sweden to extend a temporary truce and prevent the imposition of triple-digit tariffs. Delegations led by US Treasury Secretary Scott Bessent and Chinese Vice Premier He Lifeng are meeting to negotiate a lasting deal and address issues like tech restrictions, following previous talks in Geneva and London. The outcome will indicate the future of the detente between the two economic rivals.",
      "keywords": [
        "US-China trade",
        "trade deal",
        "tariffs",
        "negotiations",
        "Scott Bessent",
        "He Lifeng",
        "Stockholm talks"
      ],
      "entities": [
        "United States",
        "China",
        "Scott Bessent",
        "He Lifeng",
        "Donald Trump",
        "Stockholm",
        "Geneva",
        "London",
        "Beijing",
        "CNN Business"
      ],
      "sentiment": 0.1,
      "category": "business"
    },
    "entities": [],
    "processed_at": "2025-08-25 01:02:56.978964"
  },
  {
    "id": "edition.cnn.com_2025_07_27_business_trump-us-eu-trade-deal",
    "url": "https://edition.cnn.com/2025/07/27/business/trump-us-eu-trade-deal",
    "title": "Trump touts ‘biggest deal ever made’ as US and EU sketch trade framework | CNN Business",
    "content": "Trump touts ‘biggest deal ever made’ as US and EU sketch trade framework | CNN Business Ad Feedback CNN values your feedback 1. How relevant is this ad to you? 2. Did you encounter any technical issues? Video player was slow to load content Video content never loaded Ad froze or did not finish loading Video content did not start after ad Audio on ad was too loud Other issues Ad never loaded Ad prevented/slowed the page from loading Content moved around while ad loaded Ad was repetitive to ads I've seen previously Other issues Cancel Submit Thank You! Your effort and contribution in providing this feedback is much appreciated. Close Close icon Business Markets Tech Media Calculators Videos More Markets Tech Media Calculators Videos Watch Listen Live TV Subscribe Sign in My Account Settings Newsletters Topics you follow Sign out Your CNN account Sign in to your CNN account Sign in My Account Settings Newsletters Topics you follow Sign out Your CNN account Sign in to your CNN account Live TV Listen Watch Edition US International Arabic Español Edition US International Arabic Español Markets Tech Media Calculators Videos Follow CNN Business World Africa Americas Asia Australia China Europe India Middle East United Kingdom US Politics Trump Facts First CNN Polls 2025 Elections Business Tech Media Calculators Videos Markets Pre-markets After-Hours Fear & Greed Investing Markets Now Nightcap Health Life, But Better Fitness Food Sleep Mindfulness Relationships Entertainment Movies Television Celebrity Tech Innovate Foreseeable Future Mission: Ahead Work Transformed Innovative Cities Style Arts Design Fashion Architecture Luxury Beauty Video Travel Destinations Food & Drink Stay News Videos Sports Football Tennis Golf Motorsport US Sports Olympics Climbing Esports Hockey Science Space Life Unearthed Climate Solutions Weather Weather Video Climate Ukraine-Russia War Israel-Hamas War Features As Equals Call to Earth Freedom Project Impact Your World Inside Africa CNN Heroes Watch Live TV CNN Fast Shows A-Z CNN10 CNN Max CNN TV Schedules Listen CNN 5 Things Chasing Life with Dr. Sanjay Gupta The Assignment with Audie Cornish One Thing Tug of War CNN Political Briefing The Axe Files All There Is with Anderson Cooper All CNN Audio podcasts Games Daily Crossword Jumble Crossword Photo Shuffle Sudoblock Sudoku 5 Things Quiz About CNN Photos Investigations CNN Profiles CNN Leadership CNN Newsletters Work for CNN Markets DOW S&P 500 NASDAQ Hot Stocks Fear & Greed Index ----- is driving the US market Latest Market News info The top numbered articles will be viewable to readers when programmed onto a page. Make sure you have 30 or more cards added to the container for the machine learning (ML) feature to work. Your queued up articles, seen in the violet section, will use ML to surface up relevant content to the reader based on their individual interests and preferences. People love their fake Labubus. Can Pop Mart keep up? Small businesses are scrambling as US tariff exemption comes to an end ‘Sneakflation’: How Trump’s tariffs are gradually raising costs for American consumers Hot Stocks ----- is driving the US market Something isn't loading properly. Please check back later. Ad Feedback Ad Feedback Business • 5 min read Trump touts ‘biggest deal ever made’ as US and EU sketch trade framework By Auzinea Bacon, Alejandra Jaramillo, Elisabeth Buchwald, John Liu Updated Jul 28, 2025, 5:39 AM ET PUBLISHED Jul 27, 2025, 12:45 PM ET Video Ad Feedback Watch Trump announce framework for a trade deal with EU 1:57 - Source: CNN Watch Trump announce framework for a trade deal with EU 1:57 Politics of the Day 15 videos Video Ad Feedback Watch Trump announce framework for a trade deal with EU 1:57 - Source: CNN Watch Trump announce framework for a trade deal with EU 1:57 Video Ad Feedback Bash presses Jeffries on whether New York will join redistricting war 2:03 - Source: CNN Bash presses Jeffries on whether New York will join redistricting war 2:03 Video Ad Feedback Newsom continues to troll Trump on social media 2:30 - Source: CNN Newsom continues to troll Trump on social media 2:30 Video Ad Feedback Harry Enten shows how Trump would've lost in 2024 without improvement from mail-in voting 2:23 - Source: CNN Harry Enten shows how Trump would've lost in 2024 without improvement from mail-in voting 2:23 Video Ad Feedback See the moment Texas Republicans approve new congressional maps 0:36 - Source: CNN See the moment Texas Republicans approve new congressional maps 0:36 Video Ad Feedback Ghislaine Maxwell says she never witnessed Trump ‘in any inappropriate setting in any way’ 0:58 - Source: CNN Ghislaine Maxwell says she never witnessed Trump ‘in any inappropriate setting in any way’ 0:58 Video Ad Feedback Video: Kilmar Abrego Garcia is released from criminal custody 0:32 - Source: CNN Video: Kilmar Abrego Garcia is released from criminal custody 0:32 Video Ad Feedback Audio transcript reveals Maxwell struggled to remember decades-old eve",
    "metadata": {
      "summary": "Donald Trump has announced a preliminary trade framework between the United States and the European Union, which he referred to as the “biggest deal ever made.” This development comes amidst discussions around US tariffs and their impact on American consumers.",
      "keywords": [
        "Trump",
        "US-EU trade",
        "trade framework",
        "tariffs",
        "economy",
        "international relations",
        "business"
      ],
      "entities": [
        "Donald Trump",
        "United States",
        "European Union",
        "CNN Business",
        "Auzinea Bacon",
        "Alejandra Jaramillo",
        "Elisabeth Buchwald",
        "John Liu"
      ],
      "sentiment": 0.1,
      "category": "business"
    },
    "entities": [],
    "processed_at": "2025-08-25 01:03:01.250085"
  },
  {
    "id": "edition.cnn.com_2025_07_27_business_eu-trade-deal",
    "url": "https://edition.cnn.com/2025/07/27/business/eu-trade-deal",
    "title": "Trump’s EU deal averts disaster. But few are cheering | CNN Business",
    "content": "Trump’s EU deal averts disaster. But few are cheering | CNN Business Ad Feedback CNN values your feedback 1. How relevant is this ad to you? 2. Did you encounter any technical issues? Video player was slow to load content Video content never loaded Ad froze or did not finish loading Video content did not start after ad Audio on ad was too loud Other issues Ad never loaded Ad prevented/slowed the page from loading Content moved around while ad loaded Ad was repetitive to ads I've seen previously Other issues Cancel Submit Thank You! Your effort and contribution in providing this feedback is much appreciated. Close Close icon Business Markets Tech Media Calculators Videos More Markets Tech Media Calculators Videos Watch Listen Live TV Subscribe Sign in My Account Settings Newsletters Topics you follow Sign out Your CNN account Sign in to your CNN account Sign in My Account Settings Newsletters Topics you follow Sign out Your CNN account Sign in to your CNN account Live TV Listen Watch Edition US International Arabic Español Edition US International Arabic Español Markets Tech Media Calculators Videos Follow CNN Business World Africa Americas Asia Australia China Europe India Middle East United Kingdom US Politics Trump Facts First CNN Polls 2025 Elections Business Tech Media Calculators Videos Markets Pre-markets After-Hours Fear & Greed Investing Markets Now Nightcap Health Life, But Better Fitness Food Sleep Mindfulness Relationships Entertainment Movies Television Celebrity Tech Innovate Foreseeable Future Mission: Ahead Work Transformed Innovative Cities Style Arts Design Fashion Architecture Luxury Beauty Video Travel Destinations Food & Drink Stay News Videos Sports Football Tennis Golf Motorsport US Sports Olympics Climbing Esports Hockey Science Space Life Unearthed Climate Solutions Weather Weather Video Climate Ukraine-Russia War Israel-Hamas War Features As Equals Call to Earth Freedom Project Impact Your World Inside Africa CNN Heroes Watch Live TV CNN Fast Shows A-Z CNN10 CNN Max CNN TV Schedules Listen CNN 5 Things Chasing Life with Dr. Sanjay Gupta The Assignment with Audie Cornish One Thing Tug of War CNN Political Briefing The Axe Files All There Is with Anderson Cooper All CNN Audio podcasts Games Daily Crossword Jumble Crossword Photo Shuffle Sudoblock Sudoku 5 Things Quiz About CNN Photos Investigations CNN Profiles CNN Leadership CNN Newsletters Work for CNN Markets DOW S&P 500 NASDAQ Hot Stocks Fear & Greed Index ----- is driving the US market Latest Market News info The top numbered articles will be viewable to readers when programmed onto a page. Make sure you have 30 or more cards added to the container for the machine learning (ML) feature to work. Your queued up articles, seen in the violet section, will use ML to surface up relevant content to the reader based on their individual interests and preferences. People love their fake Labubus. Can Pop Mart keep up? Small businesses are scrambling as US tariff exemption comes to an end ‘Sneakflation’: How Trump’s tariffs are gradually raising costs for American consumers Hot Stocks ----- is driving the US market Something isn't loading properly. Please check back later. Business • 5 min read Trump’s EU deal averts disaster. But few are cheering Analysis by David Goldman Updated Jul 28, 2025, 1:57 PM ET PUBLISHED Jul 27, 2025, 7:05 PM ET President Donald Trump shakes hands with European Commission President Ursula von der Leyen after agreeing on a trade deal between the two economies following their meeting in Turnberry, Scotland, on Sunday. Brendan Smialowski/AFP/Getty Images Tariffs European Union Prescription drugs See all topics Facebook Tweet Email Link Link Copied! Follow The United States and the European Union avoided the worst-case scenario: a damaging, all-out trade war between allies that threatened to raise prices on a large number of goods and slow two of the world’s largest economies. The framework delivered a sense of relief for both sides – but few are cheering the arrangement itself. The agreement, which sets a 15% tariff on most European goods entering the United States, is higher than the 10% tariff Trump put in place on April 2 and significantly higher than the average of around 1.2% from before Trump’s presidency. But it’s significantly less than the enormous numbers Trump had been threatening if an agreement wasn’t reached. A deal with the United States felt like an impossibility in late May. Frustrated by a lack of progress in negotiations with the 27-member European Union, Trump on May 24 told the world he was done talking to some of America’s strongest allies. “Our discussions with them are going nowhere!” Trump posted on Truth Social. “I’m not looking for a deal,” he said later that day in the Oval Office. “We’ve set the deal — it’s at 50%.” The statement — and the shockingly high tariff threat — stunned European trade negotiators and rallied Europe’s leaders into action. They quickly agreed to kick talks into hig",
    "metadata": {
      "summary": "The United States and the European Union have reached a trade agreement, successfully averting a potentially damaging trade war. While the deal provides a sense of relief, it introduces a 15% tariff on most European goods, a rate significantly higher than pre-Trump levels, resulting in a muted reception despite avoiding disaster.",
      "keywords": [
        "trade deal",
        "tariffs",
        "European Union",
        "United States",
        "Donald Trump",
        "trade war",
        "economy"
      ],
      "entities": [
        "Donald Trump",
        "European Union",
        "United States",
        "Ursula von der Leyen",
        "European Commission",
        "Truth Social",
        "Turnberry",
        "Scotland",
        "David Goldman"
      ],
      "sentiment": -0.1,
      "category": "business"
    },
    "entities": [],
    "processed_at": "2025-08-25 01:03:07.650724"
  },
  {
    "id": "edition.cnn.com_2025_07_26_tech_daydream-ai-online-shopping",
    "url": "https://edition.cnn.com/2025/07/26/tech/daydream-ai-online-shopping",
    "title": "‘Revenge dress for a party in Sicily’: This platform is using AI to make online shopping hyper-personal | CNN Business",
    "content": "‘Revenge dress for a party in Sicily’: This platform is using AI to make online shopping hyper-personal | CNN Business Ad Feedback CNN values your feedback 1. How relevant is this ad to you? 2. Did you encounter any technical issues? Video player was slow to load content Video content never loaded Ad froze or did not finish loading Video content did not start after ad Audio on ad was too loud Other issues Ad never loaded Ad prevented/slowed the page from loading Content moved around while ad loaded Ad was repetitive to ads I've seen previously Other issues Cancel Submit Thank You! Your effort and contribution in providing this feedback is much appreciated. Close Close icon Business Markets Tech Media Calculators Videos More Markets Tech Media Calculators Videos Watch Listen Live TV Subscribe Sign in My Account Settings Newsletters Topics you follow Sign out Your CNN account Sign in to your CNN account Sign in My Account Settings Newsletters Topics you follow Sign out Your CNN account Sign in to your CNN account Live TV Listen Watch Edition US International Arabic Español Edition US International Arabic Español Markets Tech Media Calculators Videos Follow CNN Business World Africa Americas Asia Australia China Europe India Middle East United Kingdom US Politics Trump Facts First CNN Polls 2025 Elections Business Tech Media Calculators Videos Markets Pre-markets After-Hours Fear & Greed Investing Markets Now Nightcap Health Life, But Better Fitness Food Sleep Mindfulness Relationships Entertainment Movies Television Celebrity Tech Innovate Foreseeable Future Mission: Ahead Work Transformed Innovative Cities Style Arts Design Fashion Architecture Luxury Beauty Video Travel Destinations Food & Drink Stay News Videos Sports Football Tennis Golf Motorsport US Sports Olympics Climbing Esports Hockey Science Space Life Unearthed Climate Solutions Weather Weather Video Climate Ukraine-Russia War Israel-Hamas War Features As Equals Call to Earth Freedom Project Impact Your World Inside Africa CNN Heroes Watch Live TV CNN Fast Shows A-Z CNN10 CNN Max CNN TV Schedules Listen CNN 5 Things Chasing Life with Dr. Sanjay Gupta The Assignment with Audie Cornish One Thing Tug of War CNN Political Briefing The Axe Files All There Is with Anderson Cooper All CNN Audio podcasts Games Daily Crossword Jumble Crossword Photo Shuffle Sudoblock Sudoku 5 Things Quiz About CNN Photos Investigations CNN Profiles CNN Leadership CNN Newsletters Work for CNN Markets DOW S&P 500 NASDAQ Hot Stocks Fear & Greed Index ----- is driving the US market Latest Market News info The top numbered articles will be viewable to readers when programmed onto a page. Make sure you have 30 or more cards added to the container for the machine learning (ML) feature to work. Your queued up articles, seen in the violet section, will use ML to surface up relevant content to the reader based on their individual interests and preferences. People love their fake Labubus. Can Pop Mart keep up? Small businesses are scrambling as US tariff exemption comes to an end ‘Sneakflation’: How Trump’s tariffs are gradually raising costs for American consumers Hot Stocks ----- is driving the US market Something isn't loading properly. Please check back later. Business Tech • 4 min read ‘Revenge dress for a party in Sicily’: This platform is using AI to make online shopping hyper-personal By Clare Duffy PUBLISHED Jul 26, 2025, 4:00 AM ET AI startup Daydream wants to make online shopping easier and more personal, by letting users shop online as if they're talking to a personal stylist. madisonwi/E+/Getty Images AI Retail consumer Relationships Economy See all topics Facebook Tweet Email Link Link Copied! Follow New York — As anyone who’s scoured the internet for a bridesmaid dress knows, online shopping can be a pain. Among almost unlimited options, it can be a difficult task to find just the right style, color, size and price point. A tech startup called Daydream is now looking to fix that by letting users search for a product online in the same way they’d describe it to a friend. A user could say they’re looking for a “revenge dress to wear to a party in Sicily in July,” for example, or “a summer bag to carry to work and to cocktails after.” Daydream, which has staff in the New York and San Francisco areas, is just the latest tech company using artificial intelligence to try to make online shopping simpler and more personalized. The demand is already there — a survey of 5,000 American consumers published by Adobe Analytics showed that 39% of respondents had used a generative AI tool for online shopping last year and that 53% planned to do so this year. It’s competing with tech giants that have already launched AI tools for online shopping. Meta is using AI to make it easier for sellers to list items for sale on its apps, and to show users ads for products they’re more likely to buy. OpenAI launched an AI agent that can shop for users across the web, and Amazon is testing a simil",
    "metadata": {
      "summary": "Daydream, an AI startup, is revolutionizing online shopping by allowing users to describe desired products to an AI stylist, making the experience hyper-personal and easier. This innovation aims to overcome the challenges of sifting through vast online options, a sentiment echoed by a significant percentage of American consumers who are already using or plan to use generative AI for shopping. Daydream competes with tech giants like Meta, OpenAI, and Amazon, who are also integrating AI into their e-commerce platforms.",
      "keywords": [
        "AI",
        "online shopping",
        "personalization",
        "e-commerce",
        "retail technology",
        "Daydream",
        "tech startup"
      ],
      "entities": [
        "Daydream",
        "CNN Business",
        "Clare Duffy",
        "Adobe Analytics",
        "Meta",
        "OpenAI",
        "Amazon",
        "Sicily",
        "New York",
        "San Francisco",
        "AI",
        "Generative AI"
      ],
      "sentiment": 0.8,
      "category": "technology"
    },
    "entities": [],
    "processed_at": "2025-08-25 01:03:12.533679"
  },
  {
    "id": "edition.cnn.com_2025_07_25_tech_meta-ai-superintelligence-team-who-its-hiring",
    "url": "https://edition.cnn.com/2025/07/25/tech/meta-ai-superintelligence-team-who-its-hiring",
    "title": "Meta is shelling out big bucks to get ahead in AI. HereŌĆÖs who itŌĆÖs hiring | CNN Business",
    "content": "Meta is shelling out big bucks to get ahead in AI. HereŌĆÖs who itŌĆÖs hiring | CNN Business CNN values your feedback 1. How relevant is this ad to you? 2. Did you encounter any technical issues? Video player was slow to load content Video content never loaded Ad froze or did not finish loading Video content did not start after ad Audio on ad was too loud Other issues Ad never loaded Ad prevented/slowed the page from loading Content moved around while ad loaded Ad was repetitive to ads I've seen previously Other issues Cancel Submit Thank You! Your effort and contribution in providing this feedback is much appreciated. Close Ad Feedback Close icon Business Markets Tech Media Calculators Videos More Markets Tech Media Calculators Videos Watch Listen Live TV Subscribe Sign in My Account Settings Newsletters Topics you follow Sign out Your CNN account Sign in to your CNN account Sign in My Account Settings Newsletters Topics you follow Sign out Your CNN account Sign in to your CNN account Live TV Listen Watch Edition US International Arabic Espa├▒ol Edition US International Arabic Espa├▒ol Markets Tech Media Calculators Videos Follow CNN Business World Africa Americas Asia Australia China Europe India Middle East United Kingdom US Politics Trump Facts First CNN Polls 2025 Elections Business Tech Media Calculators Videos Markets Pre-markets After-Hours Fear & Greed Investing Markets Now Nightcap Health Life, But Better Fitness Food Sleep Mindfulness Relationships Entertainment Movies Television Celebrity Tech Innovate Foreseeable Future Mission: Ahead Work Transformed Innovative Cities Style Arts Design Fashion Architecture Luxury Beauty Video Travel Destinations Food & Drink Stay News Videos Sports Football Tennis Golf Motorsport US Sports Olympics Climbing Esports Hockey Science Space Life Unearthed Climate Solutions Weather Weather Video Climate Ukraine-Russia War Israel-Hamas War Features As Equals Call to Earth Freedom Project Impact Your World Inside Africa CNN Heroes Watch Live TV CNN Fast Shows A-Z CNN10 CNN Max CNN TV Schedules Listen CNN 5 Things Chasing Life with Dr. Sanjay Gupta The Assignment with Audie Cornish One Thing Tug of War CNN Political Briefing The Axe Files All There Is with Anderson Cooper All CNN Audio podcasts Games Daily Crossword Jumble Crossword Photo Shuffle Sudoblock Sudoku 5 Things Quiz About CNN Photos Investigations CNN Profiles CNN Leadership CNN Newsletters Work for CNN Markets DOW S&P 500 NASDAQ Hot Stocks Fear & Greed Index ----- is driving the US market Latest Market News info The top numbered articles will be viewable to readers when programmed onto a page. Make sure you have 30 or more cards added to the container for the machine learning (ML) feature to work. Your queued up articles, seen in the violet section, will use ML to surface up relevant content to the reader based on their individual interests and preferences. People love their fake Labubus. Can Pop Mart keep up? Small businesses are scrambling as US tariff exemption comes to an end ŌĆśSneakflationŌĆÖ: How TrumpŌĆÖs tariffs are gradually raising costs for American consumers Hot Stocks ----- is driving the US market Something isn't loading properly. Please check back later. Business Tech ŌĆó 5 min read Meta is shelling out big bucks to get ahead in AI. HereŌĆÖs who itŌĆÖs hiring By Clare Duffy, CNN 5 min read Updated 5:05 PM EDT, Fri July 25, 2025 Link Copied! Follow: Tech giants See your latest updates Meta CEO Mark Zuckerberg looks on before the luncheon on the inauguration day of President Donald Trump's second term in Washington, DC, January 20, 2025. Evelyn Hockstein/Reuters/File New York CNN — Meta CEO Mark Zuckerberg is on a mission for his company to be the first to reach so-called artificial superintelligence ŌĆö generally considered to mean AI thatŌĆÖs better than all humans at all knowledge work. ItŌĆÖs a nebulous and likely far-out concept that some analysts say may not immediately benefit the companyŌĆÖs core business. Yet Zuckerberg is shelling out huge sums to build an all-star team of researchers and engineers to beat OpenAI and other rivals to it. ZuckerbergŌĆÖs recruiting spree, which has reportedly included multimillion-dollar pay packages to lure top talent away from key rivals, has kicked off a talent race within the AI industry. Last month, OpenAI CEO Sam Altman claimed Meta was offering his employees $100 million signing bonuses to switch companies. And just this week, Google CEO Sundar Pichai was asked during an earnings call about his companyŌĆÖs status in the AI talent war, a sign that Wall Street is now also invested in the competition. The stakes are high for Zuckerberg ŌĆö after MetaŌĆÖs pivot to the metaverse fell flat, heŌĆÖs reoriented the company around AI in hopes of being a leader in the next transformational technology wave. The company has invested billions in data centers and chips to power its AI ambitions that itŌĆÖs now under pressure to deliver on. Unlike other tech gia",
    "metadata": {
      "summary": "Meta is heavily investing in artificial intelligence, with CEO Mark Zuckerberg aiming for artificial superintelligence. The company is engaged in a talent war, offering substantial compensation to attract top AI researchers and engineers, reportedly luring talent from rivals like OpenAI and Google. This aggressive hiring strategy follows Meta's previous pivot to the metaverse and signifies a major reorientation towards leading the next wave of technological innovation.",
      "keywords": [
        "Meta",
        "AI",
        "hiring",
        "Mark Zuckerberg",
        "OpenAI",
        "Google",
        "talent war"
      ],
      "entities": [
        "Meta",
        "Mark Zuckerberg",
        "OpenAI",
        "Sam Altman",
        "Google",
        "Sundar Pichai",
        "CNN Business"
      ],
      "sentiment": 0.3,
      "category": "technology"
    },
    "entities": [],
    "processed_at": "2025-08-25 01:03:21.717394"
  },
  {
    "id": "edition.cnn.com_2025_07_25_tech_sequoia-islamophobia-maguire-mamdani",
    "url": "https://edition.cnn.com/2025/07/25/tech/sequoia-islamophobia-maguire-mamdani",
    "title": "A prominent venture capitalist’s Islamophobic posts stir outrage among Middle Eastern and Muslim tech founders | CNN Business",
    "content": "A prominent venture capitalist’s Islamophobic posts stir outrage among Middle Eastern and Muslim tech founders | CNN Business Ad Feedback CNN values your feedback 1. How relevant is this ad to you? 2. Did you encounter any technical issues? Video player was slow to load content Video content never loaded Ad froze or did not finish loading Video content did not start after ad Audio on ad was too loud Other issues Ad never loaded Ad prevented/slowed the page from loading Content moved around while ad loaded Ad was repetitive to ads I've seen previously Other issues Cancel Submit Thank You! Your effort and contribution in providing this feedback is much appreciated. Close Close icon Business Markets Tech Media Calculators Videos More Markets Tech Media Calculators Videos Watch Listen Live TV Subscribe Sign in My Account Settings Newsletters Topics you follow Sign out Your CNN account Sign in to your CNN account Sign in My Account Settings Newsletters Topics you follow Sign out Your CNN account Sign in to your CNN account Live TV Listen Watch Edition US International Arabic Español Edition US International Arabic Español Markets Tech Media Calculators Videos Follow CNN Business World Africa Americas Asia Australia China Europe India Middle East United Kingdom US Politics Trump Facts First CNN Polls 2025 Elections Business Tech Media Calculators Videos Markets Pre-markets After-Hours Fear & Greed Investing Markets Now Nightcap Health Life, But Better Fitness Food Sleep Mindfulness Relationships Entertainment Movies Television Celebrity Tech Innovate Foreseeable Future Mission: Ahead Work Transformed Innovative Cities Style Arts Design Fashion Architecture Luxury Beauty Video Travel Destinations Food & Drink Stay News Videos Sports Football Tennis Golf Motorsport US Sports Olympics Climbing Esports Hockey Science Space Life Unearthed Climate Solutions Weather Weather Video Climate Ukraine-Russia War Israel-Hamas War Features As Equals Call to Earth Freedom Project Impact Your World Inside Africa CNN Heroes Watch Live TV CNN Fast Shows A-Z CNN10 CNN Max CNN TV Schedules Listen CNN 5 Things Chasing Life with Dr. Sanjay Gupta The Assignment with Audie Cornish One Thing Tug of War CNN Political Briefing The Axe Files All There Is with Anderson Cooper All CNN Audio podcasts Games Daily Crossword Jumble Crossword Photo Shuffle Sudoblock Sudoku 5 Things Quiz About CNN Photos Investigations CNN Profiles CNN Leadership CNN Newsletters Work for CNN Markets DOW S&P 500 NASDAQ Hot Stocks Fear & Greed Index ----- is driving the US market Latest Market News info The top numbered articles will be viewable to readers when programmed onto a page. Make sure you have 30 or more cards added to the container for the machine learning (ML) feature to work. Your queued up articles, seen in the violet section, will use ML to surface up relevant content to the reader based on their individual interests and preferences. People love their fake Labubus. Can Pop Mart keep up? Small businesses are scrambling as US tariff exemption comes to an end ‘Sneakflation’: How Trump’s tariffs are gradually raising costs for American consumers Hot Stocks ----- is driving the US market Something isn't loading properly. Please check back later. Business Tech • 8 min read A prominent venture capitalist’s Islamophobic posts stir outrage among Middle Eastern and Muslim tech founders By Ramishah Maruf PUBLISHED Jul 25, 2025, 5:30 AM ET Sequoia Capital's office in Menlo Park, California. Josh Edelson/Bloomberg/Getty Images/File The Middle East Tech news Investing Corporate news See all topics Facebook Tweet Email Link Link Copied! Follow New York — Some Muslim and Middle Eastern tech founders and leaders are among people protesting a prominent venture capitalist’s recent comments blasting New York mayoral candidate Zohran Mamdani. They say when Sequoia Capital partner Shaun Maguire called Mamdani an “Islamist” who “comes from a culture that lies about everything” earlier this month, it shined a light on what they say is pervasive Islamophobia in their industry. Maguire earlier this month made those statements – which had 5.6 million views on X, as of July 23 – in reaction to a New York Times report that Mamdani marked his ethnicity as both “Asian” and “Black or African American” on his 2009 application to Columbia University. Maguire has since continued to double down on social media, posting that Mamdani defends terrorists, raising inflammatory claims about his father, and claiming that both of them are “so excited” for a third Intifada. CNN has reached out to Mahmood Mamdani, Zohran Mamdani’s father. Maguire’s initial remarks on July 4 immediately drew backlash from the tech community as well as supporters of Mamdani. More than 1,100 people have signed an open letter to Sequoia on July 9 condemning Maguire’s comments and demanding the venture capital firm apologize and take disciplinary action against him. The signatories list includes the names of startup fou",
    "metadata": {
      "summary": "A prominent venture capitalist at Sequoia Capital, Shaun Maguire, has sparked outrage among Middle Eastern and Muslim tech founders due to Islamophobic posts targeting New York mayoral candidate Zohran Mamdani. Maguire's comments, made on social media, have led to widespread condemnation and calls for disciplinary action from the tech community.",
      "keywords": [
        "Islamophobia",
        "venture capital",
        "tech industry",
        "social media outrage",
        "Zohran Mamdani",
        "Shaun Maguire",
        "Sequoia Capital"
      ],
      "entities": [
        "Shaun Maguire",
        "Sequoia Capital",
        "Zohran Mamdani",
        "Mahmood Mamdani",
        "New York",
        "Columbia University",
        "CNN Business",
        "New York Times",
        "X"
      ],
      "sentiment": -0.8,
      "category": "business"
    },
    "entities": [],
    "processed_at": "2025-08-25 01:03:28.167545"
  },
  {
    "id": "edition.cnn.com_2025_07_24_tech_intel-layoffs-15-percent-q2-earnings",
    "url": "https://edition.cnn.com/2025/07/24/tech/intel-layoffs-15-percent-q2-earnings",
    "title": "Intel cuts 15% of its staff as it pushes to make a comeback | CNN Business",
    "content": "Intel cuts 15% of its staff as it pushes to make a comeback | CNN Business Ad Feedback CNN values your feedback 1. How relevant is this ad to you? 2. Did you encounter any technical issues? Video player was slow to load content Video content never loaded Ad froze or did not finish loading Video content did not start after ad Audio on ad was too loud Other issues Ad never loaded Ad prevented/slowed the page from loading Content moved around while ad loaded Ad was repetitive to ads I've seen previously Other issues Cancel Submit Thank You! Your effort and contribution in providing this feedback is much appreciated. Close Close icon Business Markets Tech Media Calculators Videos More Markets Tech Media Calculators Videos Watch Listen Live TV Subscribe Sign in My Account Settings Newsletters Topics you follow Sign out Your CNN account Sign in to your CNN account Sign in My Account Settings Newsletters Topics you follow Sign out Your CNN account Sign in to your CNN account Live TV Listen Watch Edition US International Arabic Español Edition US International Arabic Español Markets Tech Media Calculators Videos Follow CNN Business World Africa Americas Asia Australia China Europe India Middle East United Kingdom US Politics Trump Facts First CNN Polls 2025 Elections Business Tech Media Calculators Videos Markets Pre-markets After-Hours Fear & Greed Investing Markets Now Nightcap Health Life, But Better Fitness Food Sleep Mindfulness Relationships Entertainment Movies Television Celebrity Tech Innovate Foreseeable Future Mission: Ahead Work Transformed Innovative Cities Style Arts Design Fashion Architecture Luxury Beauty Video Travel Destinations Food & Drink Stay News Videos Sports Football Tennis Golf Motorsport US Sports Olympics Climbing Esports Hockey Science Space Life Unearthed Climate Solutions Weather Weather Video Climate Ukraine-Russia War Israel-Hamas War Features As Equals Call to Earth Freedom Project Impact Your World Inside Africa CNN Heroes Watch Live TV CNN Fast Shows A-Z CNN10 CNN Max CNN TV Schedules Listen CNN 5 Things Chasing Life with Dr. Sanjay Gupta The Assignment with Audie Cornish One Thing Tug of War CNN Political Briefing The Axe Files All There Is with Anderson Cooper All CNN Audio podcasts Games Daily Crossword Jumble Crossword Photo Shuffle Sudoblock Sudoku 5 Things Quiz About CNN Photos Investigations CNN Profiles CNN Leadership CNN Newsletters Work for CNN Markets DOW S&P 500 NASDAQ Hot Stocks Fear & Greed Index ----- is driving the US market Latest Market News info The top numbered articles will be viewable to readers when programmed onto a page. Make sure you have 30 or more cards added to the container for the machine learning (ML) feature to work. Your queued up articles, seen in the violet section, will use ML to surface up relevant content to the reader based on their individual interests and preferences. People love their fake Labubus. Can Pop Mart keep up? Small businesses are scrambling as US tariff exemption comes to an end ‘Sneakflation’: How Trump’s tariffs are gradually raising costs for American consumers Hot Stocks ----- is driving the US market Something isn't loading properly. Please check back later. Business Tech • 2 min read Intel cuts 15% of its staff as it pushes to make a comeback By Clare Duffy, Lisa Eadicicco Updated Jul 24, 2025, 5:55 PM ET PUBLISHED Jul 24, 2025, 5:29 PM ET A sign is posted in front of Intel headquarters on August 1, 2024 in Santa Clara, California. Justin Sullivan/Getty Images Corporate news Investing Stocks See all topics Facebook Tweet Email Link Link Copied! Follow New York — Intel said Thursday it has mostly completed plans it announced last quarter to cut 15% of its workforce, as the struggling chipmaker attempts a turnaround. The layoffs, tucked in Intel’s second quarter earnings report, marked one of the first major decisions by new CEO Lip-Bu Tan, who took over the company’s top job in March. “It’s going to take time, but we see clear opportunities to enhance our competitive position, improve our profitability and create long-term shareholder value,” Tan said in a press release announcing the earnings results. Intel shares (INTC) rose 3% in after-hours trading following the news, although it posted a quarterly net loss of $2.9 billion, nearly double its loss during the same period in the prior year. The stock is up nearly 12% since the start of this year, suggesting that while Intel’s future is far from certain, investors have confidence in Tan. Intel said the staff reduction is “designed to create a faster-moving, flatter and more agile organization.” The company reported having 108,900 employees as of the end of 2024 across Intel and its subsidiaries, which include autonomous driving company Mobileye. The company said it plans to end 2025 with 75,000 employees in its core Intel division — not including subsidiaries — as a result of “workforce reductions and attrition. Intel filed a﻿ layoff notice in Oregon earlier this month i",
    "metadata": {
      "summary": "Intel is cutting 15% of its workforce as part of a turnaround strategy led by new CEO Lip-Bu Tan, aiming for a \"faster-moving, flatter and more agile organization.\" Despite reporting a significant net loss in the second quarter, the struggling chipmaker's stock rose, indicating investor confidence in the new leadership and comeback plan.",
      "keywords": [
        "Intel",
        "layoffs",
        "workforce reduction",
        "CEO",
        "turnaround strategy",
        "semiconductor industry",
        "earnings report"
      ],
      "entities": [
        "Intel",
        "Lip-Bu Tan",
        "Mobileye",
        "CNN Business",
        "Santa Clara",
        "California",
        "Oregon"
      ],
      "sentiment": 0.3,
      "category": "business"
    },
    "entities": [],
    "processed_at": "2025-08-25 01:03:33.570017"
  }
]